<a href="https://colab.research.google.com/github/saffarizadeh/INSY4054/blob/main/Working_with_Spreadsheets.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Opening an Excel File

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html

In [1]:
import pandas as pd

In [2]:
excel_file_address = 'http://saffarizadeh.com/ET/Students.xlsx'

In [3]:
students_sheet1 = pd.read_excel(excel_file_address, sheet_name=0, index_col=0)

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.head.html

In [4]:
students_sheet1.head()

   First Name Last Name  Quiz 1  Quiz 2  Attendance
ID
1      Amalia   Pearson      90      80           5
2      Leyton  Richmond     100      80           4
3     Phoenix   Stanton      85     100           3
4      Hafsah    Cotton      90      90           4
5        Cloe     Perez      80      90           5

In [5]:
students_sheet2 = pd.read_excel(excel_file_address, sheet_name=1)

In [6]:
students_sheet2.head()

   Number of Sessions  Quiz Weight  Attendance Weight
0                   5          0.7                0.3

In [7]:
students_sheet3 = pd.read_excel(excel_file_address, sheet_name=2, index_col=0)

In [8]:
students_sheet3.head()

      Email
ID
1   a@b.com
2   b@c.com
3       NaN
4       NaN
5       NaN

# Analyzing and Modifying an Excel File

In [9]:
students_sheet1.describe()

           Quiz 1    Quiz 2  Attendance
count    5.000000    5.0000     5.00000
mean    89.000000   88.0000     4.20000
std      7.416198    8.3666     0.83666
min     80.000000   80.0000     3.00000
25%     85.000000   80.0000     4.00000
50%     90.000000   90.0000     4.00000
75%     90.000000   90.0000     5.00000
max    100.000000  100.0000     5.00000

## Access a group of rows and columns

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html

In [10]:
students_sheet1[0:2]

   First Name Last Name  Quiz 1  Quiz 2  Attendance
ID
1      Amalia   Pearson      90      80           5
2      Leyton  Richmond     100      80           4

In [11]:
students_sheet1.loc[1]

First Name     Amalia
Last Name     Pearson
Quiz 1             90
Quiz 2             80
Attendance          5
Name: 1, dtype: object

In [12]:
students_sheet1.iloc[1]

First Name      Leyton
Last Name     Richmond
Quiz 1             100
Quiz 2              80
Attendance           4
Name: 2, dtype: object

In [13]:
students_sheet1["Quiz 1"]

ID
1     90
2    100
3     85
4     90
5     80
Name: Quiz 1, dtype: int64

In [14]:
students_sheet1["Quiz 1"][1]

90

In [15]:
students_sheet1["Quiz 1"].iloc[0]

90

## Access a single value for a row/column pair
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.at.html
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iat.html

In [16]:
students_sheet1.at[1, "Quiz 1"]

90

In [17]:
students_sheet1.iat[0, 2]

90

## Analyze the data

In [18]:
students_sheet1[students_sheet1["Quiz 1"] >= 90]

   First Name Last Name  Quiz 1  Quiz 2  Attendance
ID
1      Amalia   Pearson      90      80           5
2      Leyton  Richmond     100      80           4
4      Hafsah    Cotton      90      90           4

In [ ]:
students_sheet1["Quiz 1"].mean()

89.0

In [ ]:
students_sheet1[students_sheet1["Quiz 1"] >= students_sheet1["Quiz 1"].mean()]

   First Name Last Name  Quiz 1  Quiz 2  Attendance
ID
1      Amalia   Pearson      90      80           5
2      Leyton  Richmond     100      80           4
4      Hafsah    Cotton      90      90           4

In [ ]:
students_sheet1["Quiz 2"].mean()

88.0

In [ ]:
students_sheet1[(students_sheet1["Quiz 1"] >= students_sheet1["Quiz 1"].mean()) | (students_sheet1["Quiz 2"] >= students_sheet1["Quiz 2"].mean())]

   First Name Last Name  Quiz 1  Quiz 2  Attendance
ID
1      Amalia   Pearson      90      80           5
2      Leyton  Richmond     100      80           4
3     Phoenix   Stanton      85     100           3
4      Hafsah    Cotton      90      90           4
5        Cloe     Perez      80      90           5

In [ ]:
both_quizzes_above_average = students_sheet1[(students_sheet1["Quiz 1"] >= students_sheet1["Quiz 1"].mean()) & (students_sheet1["Quiz 2"] >= students_sheet1["Quiz 2"].mean())]
both_quizzes_above_average

   First Name Last Name  Quiz 1  Quiz 2  Attendance
ID
4      Hafsah    Cotton      90      90           4

In [ ]:
students_sheet1["Quiz Average"] = (students_sheet1["Quiz 1"] + students_sheet1["Quiz 2"])/2

In [ ]:
# quiz_columns = []

# for column in students_sheet1.columns:
#   if "Quiz" in column:
#     quiz_columns.append(column)

quiz_columns = [column for column in students_sheet1.columns if "Quiz" in column]

In [ ]:
quiz_columns

['Quiz 1', 'Quiz 2', 'Quiz Average']

In [ ]:
students_sheet1[quiz_columns[0]]

ID
1     90
2    100
3     85
4     90
5     80
Name: Quiz 1, dtype: int64

Slicing Columns

In [24]:
students_sheet1.iloc[:, 1:4]

   Last Name  Quiz 1  Quiz 2
ID
1    Pearson      90      80
2   Richmond     100      80
3    Stanton      85     100
4     Cotton      90      90
5      Perez      80      90

In [25]:
students_sheet1.loc[:, "Last Name": "Quiz 2"]

   Last Name  Quiz 1  Quiz 2
ID
1    Pearson      90      80
2   Richmond     100      80
3    Stanton      85     100
4     Cotton      90      90
5      Perez      80      90

## Dividing a Column by a Number (scalar) and Adding New Columns

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_numpy.html

In [ ]:
students_sheet2["Number of Sessions"].to_numpy()

array([5])

In [ ]:
students_sheet1["Attendance Score"] = 100*students_sheet1["Attendance"] / students_sheet2["Number of Sessions"].to_numpy()

In [ ]:
students_sheet1.head()

   First Name Last Name  Quiz 1  ...  Attendance  Quiz Average  Attendance Score
ID                               ...
1      Amalia   Pearson      90  ...           5          85.0             100.0
2      Leyton  Richmond     100  ...           4          90.0              80.0
3     Phoenix   Stanton      85  ...           3          92.5              60.0
4      Hafsah    Cotton      90  ...           4          90.0              80.0
5        Cloe     Perez      80  ...           5          85.0             100.0

[5 rows x 7 columns]

In [ ]:
students_sheet1["Final Score"] = ((students_sheet1["Attendance Score"] * students_sheet2["Attendance Weight"].values)
                                 +(students_sheet1["Quiz Average"] * students_sheet2["Quiz Weight"].values))

In [ ]:
students_sheet1.head()

   First Name Last Name  Quiz 1  ...  Quiz Average  Attendance Score  Final Score
ID                               ...
1      Amalia   Pearson      90  ...          85.0             100.0        89.50
2      Leyton  Richmond     100  ...          90.0              80.0        87.00
3     Phoenix   Stanton      85  ...          92.5              60.0        82.75
4      Hafsah    Cotton      90  ...          90.0              80.0        87.00
5        Cloe     Perez      80  ...          85.0             100.0        89.50

[5 rows x 8 columns]

## Dropping a Column
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html

In [ ]:
students_sheet1["xyz"] = 0

In [ ]:
students_sheet1

   First Name Last Name  Quiz 1  ...  Attendance Score  Final Score  xyz
ID                               ...
1      Amalia   Pearson      90  ...             100.0        89.50    0
2      Leyton  Richmond     100  ...              80.0        87.00    0
3     Phoenix   Stanton      85  ...              60.0        82.75    0
4      Hafsah    Cotton      90  ...              80.0        87.00    0
5        Cloe     Perez      80  ...             100.0        89.50    0

[5 rows x 9 columns]

In [ ]:
students_sheet1 = students_sheet1.drop(columns=["xyz"])

In [ ]:
students_sheet1

   First Name Last Name  Quiz 1  ...  Quiz Average  Attendance Score  Final Score
ID                               ...
1      Amalia   Pearson      90  ...          85.0             100.0        89.50
2      Leyton  Richmond     100  ...          90.0              80.0        87.00
3     Phoenix   Stanton      85  ...          92.5              60.0        82.75
4      Hafsah    Cotton      90  ...          90.0              80.0        87.00
5        Cloe     Perez      80  ...          85.0             100.0        89.50

[5 rows x 8 columns]

## Iterating over dataframes
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iterrows.html

While it is not a good idea to iterate over dataframes, it is possible to do so. In most cases, we should try and use dataframe operations to manipulate the data instead of iterating over the table.

In [ ]:
for index, row in students_sheet1.iterrows():
  print(row['First Name'], row['Last Name'])
  students_sheet1.at[index, "Final Score"] = row['Final Score'] + 2
  # students_sheet1["Final Score"][index] = row['Final Score'] + 2

Amalia Pearson
Leyton Richmond
Phoenix Stanton
Hafsah Cotton
Cloe Perez

In [ ]:
students_sheet1.head()

   First Name Last Name  Quiz 1  ...  Quiz Average  Attendance Score  Final Score
ID                               ...
1      Amalia   Pearson      90  ...          85.0             100.0        91.50
2      Leyton  Richmond     100  ...          90.0              80.0        89.00
3     Phoenix   Stanton      85  ...          92.5              60.0        84.75
4      Hafsah    Cotton      90  ...          90.0              80.0        89.00
5        Cloe     Perez      80  ...          85.0             100.0        91.50

[5 rows x 8 columns]

## Sorting the data
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html

In [ ]:
students_sheet1_by_quiz1 = students_sheet1.sort_values(['Final Score'], ascending=False)
students_sheet1_by_quiz1.head()

   First Name Last Name  Quiz 1  ...  Quiz Average  Attendance Score  Final Score
ID                               ...
1      Amalia   Pearson      90  ...          85.0             100.0        91.50
5        Cloe     Perez      80  ...          85.0             100.0        91.50
2      Leyton  Richmond     100  ...          90.0              80.0        89.00
4      Hafsah    Cotton      90  ...          90.0              80.0        89.00
3     Phoenix   Stanton      85  ...          92.5              60.0        84.75

[5 rows x 8 columns]

# Saving as an Excel File
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_excel.html
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.ExcelWriter.html

In [ ]:
students_sheet1.to_excel('output.xlsx', sheet_name='grades', index=True)

In [ ]:
with pd.ExcelWriter('output_all_sheets.xlsx') as writer:
  students_sheet1.to_excel(writer, sheet_name='grades', index=True)
  both_quizzes_above_average.to_excel(writer, sheet_name='both quizzes above avg', index=True)